OpenFOAM/libAcoustics-OFv1812/cases/FFWH+cfdbem_1D/0/cyc
    "(cyc1|cyc2|cyc3|cyc4)"
    {
        type            wedge;
    }

